tonchval2307/Codigos-Arduino/PIC16F877A-PIC18F4550/RemCtrlPIC.X/system.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/* 
 * File:   
 * Author: 
 * Comments:
 * Revision history: 
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef XC_HEADER_TEMPLATE_H
#define	XC_HEADER_TEMPLATE_H

#include <xc.h> // include processor files - each processor file is guarded.  

// TODO Insert appropriate #include <>
#include <stdint.h>
#include <pic18f4550.h>
#include <delays.h>
#include "xlcd.h"

// TODO Insert C++ class definitions if appropriate
#pragma config PLLDIV = 5       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HSPLL_HS  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)

#define _XTAL_FREQ 48000000
#define HIGH 1
#define LOW 0
#define OUTPUT 0
#define INPUT 1
/* Program Definitions*/
#define TRIS_SDI TRISB0 //MOSI
#define TRIS_SCK TRISB1 //SCK
#define TRIS_CS  TRISA5 //nSS
#define TRIS_SDO TRISC7 //MISO
#define ADCON0Reg 0
#define ADCON1Reg 1
#define ADCON2Reg 2
#define TMR2PRESCALE 16

void SPISlaveInit(void);
char SPIBufferFull(void);
char SPIRead(void);
void SPIWrite(char data);
char SPIOverflow(void);
void interrupt SPIProcess(void);
/*- SPI Declaration*/

/* Functions Declarations*/
void configuracionInicial(void);
void loop(void);
void setup(void);
void delay(const int milis);
void delayMicroseconds(const int micros);
void DelayFor18TCY(void);
void DelayPORXLCD(void);
void DelayXLCD(void);
void LCDInit(void);
void LCDSetCursor(char line, char col);
void ProcessCommand(char data);
void PantallaStartingState(void);
void PantallaRun(void);
void PantallaTestLocal(void);
void PantallaTestRemote(void);
void PantallaGPIOConfig(void);
void PantallaSetRstGPIO(void);
void PantallaReadGPIO(void);
void PantallaRotacionLlantas(void);
void PantallaPruebaUltrasonico(void);

/** Functions GPIOs, PWMs, TImer COnfigurations*/
/* GPIO delcaration*/
void pinMode(char pin, char mode);
void digitalWrite(char pin, char mode);
char digitalRead(char pin);
//---------------------------------------//
/* ADC Operation Functions*/
void ADCConfig(void);
unsigned int analogRead(char pin);
void ADCSetParam(char reg, char  cmd);
//-------------------------------------//
//CCP Module Functions//
void CCPConfig(void);
void analogWrite(char pin, unsigned int value);
//---------------------------------------//
// Timers Configuration-------------------///
void TMR0Config(void);
double Time(void);
unsigned long milliseconds( unsigned long mil);
void TMR1Config(void);
double PulseIn(char pin);
double Frequency(void);
void TMR2Config(void);
void TMR3Config(void);
//------------------------------------------//
/* GPIO Parameters*/
void PORTAConfig(void);
void PORTBConfig(void);
void PORTCConfig(void);
void PORTDConfig(void);
void PORTEConfig(void);

//-----Push Buttons Reading-------//
char PBRead(char pin);
int PWM_Max_Duty(void);
void PWM1_Init(long fre);
void PWM2_Init(long fre);
void PWM1_Start(void);
void PWM1_Stop(void);
void PWM2_Start(void);
void PWM2_Stop(void);
/* Automatic Controller (PID Loop 1) Declarations********/
void PID1Init(double prop, double inte, double deri, double samtime);
double ComputePID1(double Input, double SetPoint);
void SetPID1Tunings(double p, double dt, double si);
void SetPID1SampleTime(double seconds);
void SetOutputLimits(double min, double max);
double rescale(double x, double in_min, double in_max, double out_min, double out_max);
/* Serial Comunication */
char SerialBegin(const long int baudRate);
void SerialWrite(int dataWrite);
char SerialRead(void);
unsigned int SerialAvailable(void);
char SerialWriteText(char *dataText);
void SerialReadText(char *Output, unsigned int lenght);
/* ----------------------- */
/******************************************************/
/* sensor Color declaration */
double ReadColorSensor(char sensor, char color);
void SensorRGB1(void);
void SensorRGB2(void);
void SensorRGB3(void);
void SensoresRGBInit(char S1R, char S1G, char S1B,char S2R, char S2G, char S2B,char S3R, char S3G, char S3B);
void SelectColorInit(char pinRed, char pinGreen, char pinBlue);
void SelectColor(char color);
// TODO Insert declarations or function prototypes (right here) to leverage 
// live documentation
void InitController(void);
void controllerOperation(void);

#ifdef	__cplusplus
extern "C" {
#endif /* __cplusplus */

    // TODO If C++ is being used, regular C code needs function names to have C 
    // linkage so the functions can be used by the c code. 

#ifdef	__cplusplus
}
#endif /* __cplusplus */

#endif	/* XC_HEADER_TEMPLATE_H */

